# Let's play with a Pandas Dataframe!

## This script contains some simple (but helpful) tips about the library Pandas

## Creating a dataframe

First we can create a dataframe using the ***DataFrame*** function from **pandas**

**DON'T forget to import the library!!!**

In [4]:
# Let's import the library using an ALIAS (it's like a nickname and help us to avoid to write too much)
# We'll use the numpy library to create random numbers for our dataset

import pandas as pd
import numpy as np

In [34]:
# np.random.randn(5,4) - 5 rows and 4 columns

df = pd.DataFrame(np.random.randn(5,4),['A','B','C','D','E'], ['W','X','Y','Z']) #pd.DataFrame(data,index,columns)

## Looking into the dataset

In [7]:
# Using the command head() we can see the 5 firt lines on dataset, or we can set a number like: df.head(10) - 10 first lines

df.head()

          W         X         Y         Z
A  1.187663 -1.170511  0.321736 -0.513612
B -0.484082 -0.744548 -1.091237  1.012705
C -2.108682 -0.416427  0.231960  0.833967
D  1.243194  1.361595  0.120760  1.191226
E -0.242877  2.512725 -0.001958  1.100114

## Creating and dropping a new column

In [8]:
# Using the columns X and Y, let's create a new one with the sum of them

df['newColumn'] = df['X'] + df['Y']

#Let's see again the dataset

df

          W         X         Y         Z  newColumn
A  1.187663 -1.170511  0.321736 -0.513612  -0.848775
B -0.484082 -0.744548 -1.091237  1.012705  -1.835785
C -2.108682 -0.416427  0.231960  0.833967  -0.184467
D  1.243194  1.361595  0.120760  1.191226   1.482354
E -0.242877  2.512725 -0.001958  1.100114   2.510767

In [9]:
# Now, let's delete the new column

df.drop('newColumn', axis =1, inplace = True)

# .drop('columnName to delete', axis= (1 for column, 0 for row), inplace = True(save the change))

df

          W         X         Y         Z
A  1.187663 -1.170511  0.321736 -0.513612
B -0.484082 -0.744548 -1.091237  1.012705
C -2.108682 -0.416427  0.231960  0.833967
D  1.243194  1.361595  0.120760  1.191226
E -0.242877  2.512725 -0.001958  1.100114

## Looking for elements on the dataframe

In [10]:
# Let's start using .loc passing the row and column to the searcher

df.loc['D','X']

1.3615946654710547

In [11]:
# We can search for more than one row

# We need pass a list of lists where the first list is the name of rows and the second one is the name of columns

df.loc[['A','E'],['X','Z']]

          X         Z
A -1.170511 -0.513612
E  2.512725  1.100114

In [13]:
# We can find information using a conditional search

# Think like this: look in df wher df is less than zero

df[df<0]

          W         X         Y         Z
A       NaN -1.170511       NaN -0.513612
B -0.484082 -0.744548 -1.091237       NaN
C -2.108682 -0.416427       NaN       NaN
D       NaN       NaN       NaN       NaN
E -0.242877       NaN -0.001958       NaN

In [17]:
# Using the same idea to a specific column

# This command will return the line(s) where df in the column W is less than -2

df[df.W <-2]

          W         X        Y         Z
C -2.108682 -0.416427  0.23196  0.833967

In [22]:
# We can write the column name between ' ' or just using a dot 

# Let's see if df.W.A (column W row A) is the same that df['W']['A']

df.W.A == df['W']['A']

True

In [25]:
# We can search a column using other column as search reference

# Think like this: Look in df where df column W is greater than zero and bring me the numbers of Y column

df[df.W>0]['Y']

A    0.321736
D    0.120760
Name: Y, dtype: float64

In [26]:
# Looking with more parameters -  in this case we use the condiction AND, but writing &

df[(df.W >0) & (df['Y']>0.3)]

          W         X         Y         Z
A  1.187663 -1.170511  0.321736 -0.513612

In [27]:
# The same but using the condiction OR, writting |
df[(df.W >0) | (df.Z>1)]

          W         X         Y         Z
A  1.187663 -1.170511  0.321736 -0.513612
B -0.484082 -0.744548 -1.091237  1.012705
D  1.243194  1.361595  0.120760  1.191226
E -0.242877  2.512725 -0.001958  1.100114

## Changing the index of our dataframe

Sometimes is very usefull to change the index to organize the informations

In [36]:
# We can use the function split to "cut" the string into single words, in this case, dropping the space between them

# Firts, let's create a new column with countries

df['Country'] = "USA Brazil Canada Mexico Japan".split()
df

          W         X         Y         Z Country
A  0.320606 -0.998531 -0.158048 -0.652877     USA
B -0.068018  2.303079  1.547574 -0.059329  Brazil
C  0.632964 -1.264857  0.002128 -0.181852  Canada
D -1.287712 -0.392282 -1.104221  0.563214  Mexico
E  0.932000  1.008135 -0.164005  0.632701   Japan

In [37]:
# Now we can set the countries as indexes

df.set_index('Country', inplace = True)
df

                W         X         Y         Z
Country
USA      0.320606 -0.998531 -0.158048 -0.652877
Brazil  -0.068018  2.303079  1.547574 -0.059329
Canada   0.632964 -1.264857  0.002128 -0.181852
Mexico  -1.287712 -0.392282 -1.104221  0.563214
Japan    0.932000  1.008135 -0.164005  0.632701

## Making a Group!

Pandas has a function called groupby that make a group of information using a column to create that

In [60]:
data = {'Team':['PSG', 'PSG','Barcelona','Real Madrid', 'Milan','Milan'],
       'BestPlayers':['Neymar', 'Mbappe','Messi','CR7','Ibrah', 'Kaka'],
       'Overall':[97,92,98,95,92,92],
       'Value_MM':[100,130,95,55,85,68]}

df = pd.DataFrame(data)
df

          Team BestPlayers  Overall  Value_MM
0          PSG      Neymar       97       100
1          PSG      Mbappe       92       130
2    Barcelona       Messi       98        95
3  Real Madrid         CR7       95        55
4        Milan       Ibrah       92        85
5        Milan        Kaka       92        68

In [61]:
group = df.groupby('Team')
group.sum()

             Overall  Value_MM
Team
Barcelona         98        95
Milan            184       153
PSG              189       230
Real Madrid       95        55

**We can acess a statistical description of the group**

In [62]:
group.describe()

            Overall                                                 Value_MM  \
              count  mean       std   min    25%   50%    75%   max    count
Team
Barcelona       1.0  98.0       NaN  98.0  98.00  98.0  98.00  98.0      1.0
Milan           2.0  92.0  0.000000  92.0  92.00  92.0  92.00  92.0      2.0
PSG             2.0  94.5  3.535534  92.0  93.25  94.5  95.75  97.0      2.0
Real Madrid     1.0  95.0       NaN  95.0  95.00  95.0  95.00  95.0      1.0


              mean        std    min     25%    50%     75%    max
Team
Barcelona     95.0        NaN   95.0   95.00   95.0   95.00   95.0
Milan         76.5  12.020815   68.0   72.25   76.5   80.75   85.0
PSG          115.0  21.213203  100.0  107.50  115.0  122.50  130.0
Real Madrid   55.0        NaN   55.0   55.00   55.0   55.00   55.0

**We can also search inside the group**

In [67]:
group.mean().loc['PSG']

Overall      94.5
Value_MM    115.0
Name: PSG, dtype: float64

## Finding information in a dataframe

In [68]:
# Return the unique values in the column

df.BestPlayers.unique()

array(['Neymar', 'Mbappe', 'Messi', 'CR7', 'Ibrah', 'Kaka'], dtype=object)

In [69]:
# Count the numbers of unique values in the column

df.BestPlayers.nunique()

6

In [72]:
# Count of the number of occurence in the column

df.Team.value_counts()

Milan          2
PSG            2
Real Madrid    1
Barcelona      1
Name: Team, dtype: int64

In [75]:
# Sorting values - by the column overall in an ascending shape

df.sort_values(by = "Overall", ascending = True)

          Team BestPlayers  Overall  Value_MM
1          PSG      Mbappe       92       130
4        Milan       Ibrah       92        85
5        Milan        Kaka       92        68
3  Real Madrid         CR7       95        55
0          PSG      Neymar       97       100
2    Barcelona       Messi       98        95

In [76]:
# There's Null/missing values in the dataframe?

df.isnull()

    Team  BestPlayers  Overall  Value_MM
0  False        False    False     False
1  False        False    False     False
2  False        False    False     False
3  False        False    False     False
4  False        False    False     False
5  False        False    False     False

In [78]:
# Return the sum of the number of null/missing values

df.isnull().sum()

Team           0
BestPlayers    0
Overall        0
Value_MM       0
dtype: int64